# SystemsAnalysisWorkflowFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSystemsAnalysisReport..::..SystemsAnalysisWorkflowFile Property
ViewSystemsAnalysisReport Class See Also
---
The full path name of the original system analysis workflow file.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public string SystemsAnalysisWorkflowFile { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SystemsAnalysisWorkflowFile As String
	Get
```

Visual C++
---
```text
public:
property String^ SystemsAnalysisWorkflowFile {
	String^ get ();
}
```

# See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace